sources/part_03/advanced_foil/foil_gmsh_mesh/icoFoam/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

module purge
module load OpenFOAM/10-foss-2022a
source $FOAM_BASH

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# if $(getaApplication) does not work
# appName=$1
appName=$(getApplication)

# ***********************************
# *** run it in NON-parallel mode ***
# ***********************************

echo "Start $appName in parallel. Log is written in case/log.$appName!"
runApplication $appName


# **************************************************
# *** cusomize it for parallel run on HPC system ***
# **************************************************

# decompose the case (number of decompositions is equal to --ntasks)
#runApplication decomposePar

# run parallel
#echo "Start $appName in parallel. Log is written in case/log.$appName!"
#runParallel $appName &
#mpirun -n 6  $appName -parallel > log.$appName 2>&1


